// 336540331 - Shemiakin Leonid
// תרגיל מבוא
// Targil 1

const num = 123;

const divBy2 = (num%2 === 0);
const divBy3 = (num%3 === 0);
const divBy5 = (num%5 === 0);

const countDivisors = divBy2 + divBy3 + divBy5;
console.log(countDivisors);

/*
תרגיל 1כתבו תכנית המגדירה מספר (למשל const num = 123). התכנית בודקת ומדפיסה עבור המספר הנתון:
א. אם המספר מתחלק ב-2 או ב-3 או ב-5 –יש להדפיס 1 (מתחלק רק במספר אחד בלבד).
ב. אם המספר מתחלק גם ב-2 וב-3 או  ב-3 וב-5 או ב-2 וב-5 – יש להדפס 2 (מתחלק בשני מספרים בלבד).
ג. אם המספר מתחלק גם ב-2 וב-3 וב-5 – יש להדפיס 3.

אין להשתמ ב-if או מבנה בקרה אחר.
חובה להשתמש בפעולות לוגיות כפי שאתם נדרשים בשיעורי JavaScript. שימו לב שפעולות לוגיות מחזירות טיפוס בוליאני. ניתן להפוך אותו למספר ע"י שימוש ב- Number(num). בדקו מה פעולה זו מחזירה עבור true ומה עבור false
יש להדפיס תוצאה אחת בלבד.
*/